000000*****************************************************************
000000 IDENTIFICATION                  DIVISION.   
000000 PROGRAM-ID.                     MAIN.
000000*/-------------------------------------------------------------/*     
000000*    PROGRAM-ID     :            PGM001                               
000000*    CREATE DATE    :            2026/01/21                              
000000*    AUTHOR         :            Elyz                      
000000*    PURPOSE        :            PGM001 へのパスパラメータ値のプロ
000000*                                グラムコール
000000*/-------------------------------------------------------------/*   
000000*    UPDATE         :                                           
000000*        2026/01/21 :            リンケージセクションを介してパラメ
000000*                                ータを送信
000000*/-------------------------------------------------------------/*   
000000 ENVIRONMENT                     DIVISION.                                                   
000000 DATA                            DIVISION.                                                      
000000 WORKING-STORAGE                 SECTION.  
000000*/-------------------------------------------------------------/*
000000*  JCL パラメータ受け取りエリア                                                     
000000*/-------------------------------------------------------------/* 
000000 01  LNK-PARAM-JCL.                                                      
000000   03 LNK-PARAM-LENGHT           PIC S9(04) COMP VALUE 11.                        
000000   03 LNK-PARAM-DATA             PIC X(11).
000000*/-------------------------------------------------------------/*
000000*  ワークエリア                                                   
000000*/-------------------------------------------------------------/*
000000 01  WS-FUNC-ID                  PIC 9(01).                                      
000000 01  WS-ACC-ID                   PIC 9(09).                                      
000000*===============================================================*         
000000*====        ＰＲＯＣＥＤＵＲＥ　　 　　ＤＩＶＩＳＩＯＮ        ====*         
000000*===============================================================*       
000000 PROCEDURE DIVISION. 
000000*/-------------------------------------------------------------/*         
000000*                                | NOTE: 価値を伝える                     
000000* MAIN                   SECTION |      （COMMON）                      
000000*                                |                                      
000000*/-------------------------------------------------------------/*     
000000     MOVE 1                      TO WS-FUNC-ID                                  
000000     MOVE 000004001              TO WS-ACC-ID 
000000*                                 
000000     STRING                                                          
000000         WS-FUNC-ID              DELIMITED BY SIZE                          
000000         ','                     DELIMITED BY SIZE                          
000000         WS-ACC-ID               DELIMITED BY SIZE                          
000000         INTO                    LNK-PARAM-DATA                                              
000000     END-STRING.
000000*                                                      
000000     CALL 'PGM001' USING LNK-PARAM-JCL.
000000*                                  
000000     STOP RUN.
000000*                                    
000000 END PROGRAM MAIN.  
000000*===============================================================*         
000000*====           ＥＮＤ　 　ＯＦ　 　ＰＲＯＣＥＤＵＲＥ　       ====*         
000000*===============================================================*
000000*****************************************************************                